# MismatchedSystemClassificationNoSystemWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..MismatchedSystemClassificationNoSystemWarning Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The selected fixture is assigned to a system with different classification.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MismatchedSystemClassificationNoSystemWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MismatchedSystemClassificationNoSystemWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MismatchedSystemClassificationNoSystemWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace